let allListeningData = [

{
    audio:"audio/1.wav",
    q:"おとこのひとは なにを ちゅうもんしましたか。",
    answer:"ラーメンとおちゃ",
    choices:[
        "ラーメンとおちゃ",
        "カレーとおちゃ",
        "ラーメンだけ",
        "うどんとおちゃ"
    ]
},

{
    audio:"audio/2.wav",
    q:"おんなのひとは なんじの でんしゃに のりますか。",
    answer:"10じ30ぷん",
    choices:[
        "10じ",
        "10じ15ふん",
        "10じ30ぷん",
        "11じ"
    ]
},

{
    audio:"audio/3.wav",
    q:"おとこのひとは いつ はたらきますか。",
    answer:"きんようび",
    choices:[
        "げつようび",
        "かようび",
        "きんようび",
        "どようび"
    ]
},

{
    audio:"audio/4.wav",
    q:"おんなのひとは どうしますか。",
    answer:"いえで やすみます",
    choices:[
        "びょういんへ いきます",
        "いえで やすみます",
        "しごとへ いきます",
        "かいものへ いきます"
    ]
},

{
    audio:"audio/5.wav",
    q:"おとこのひとは いくら はらいますか。",
    answer:"650えん",
    choices:[
        "500えん",
        "550えん",
        "650えん",
        "700えん"
    ]
},

{
    audio:"audio/6.wav",
    q:"おんなのひとは なにを もちますか。",
    answer:"かさ",
    choices:[
        "かさ",
        "ぼうし",
        "ほん",
        "かばん"
    ]
},

{
    audio:"audio/7.wav",
    q:"おとこのひとは なにを しますか。",
    answer:"コピーします",
    choices:[
        "でんわします",
        "そうじします",
        "コピーします",
        "メールします"
    ]
},

{
    audio:"audio/8.wav",
    q:"ぎんこうは どこですか。",
    answer:"ふたつめのしんごうをみぎ",
    choices:[
        "ひとつめのしんごうをみぎ",
        "ふたつめのしんごうをみぎ",
        "ふたつめのしんごうをひだり",
        "まっすぐいってひだり"
    ]
},

{
    audio:"audio/9.wav",
    q:"テストは いつですか。",
    answer:"らいしゅうのげつようび",
    choices:[
        "こんしゅうのげつようび",
        "らいしゅうのかようび",
        "らいしゅうのげつようび",
        "らいしゅうのきんようび"
    ]
},

{
    audio:"audio/10.wav",
    q:"おんなのひとは どのへやを かりますか。",
    answer:"301ごうしつ",
    choices:[
        "201ごうしつ",
        "301ごうしつ",
        "305ごうしつ",
        "401ごうしつ"
    ]
},


{
    audio:"audio/11.wav",
    q:"おとこのひとは なにを ちゅうもんしましたか。",
    answer:"パンとぎゅうにゅう",
    choices:[
        "パンとぎゅうにゅう",
        "サンドイッチとぎゅうにゅう",
        "パン",
        "サンドイッチ"
    ]
},

{
    audio:"audio/12.wav",
    q:"おんなのひとは どこへいきますか。",
    answer:"ゆうびんきょく",
    choices:[
        "ゆうびんきょく",
        "はがき",
        "としょかん",
        "けいさつ"
    ]
},

{
    audio:"audio/13.wav",
    q:"かいぎはなんじからですか。",
    answer:"14じ",
    choices:[
        "1じ30ぷん",
        "1じ",
        "14じ",
        "2じ"
    ]
},

{
    audio:"audio/14.wav",
    q:"",
    answer:"映画を見に行く",
    choices:[
"アルバイトをする",
"買い物へ行く",
"映画を見に行く",
"家で勉強する"
]
},

{
    audio:"audio/15.wav",
    q:"",
    answer:"熱があるから",
    choices:[
"頭がいたいから",
"熱があるから",
"仕事がないから",
"旅行へいくから"
    ]
},

{
    audio:"audio/16.wav",
    q:"",
    answer:"レストラン",
    choices:[
        "しょくどう",
        "レストラン",
        "コンビニ",
        "公園"
    ]
},

{
    audio:"audio/17.wav",
    q:"",
    answer:"郵便局（ゆうびんきょく）",
    choices:[
"銀行（ぎんこう）",
"郵便局（ゆうびんきょく）",
"市役所（しやくしょ）",
"病院（びょういん）"
]
},

{
    audio:"audio/18.wav",
    q:"",
    answer:"来週の月曜日",
    choices:[
"今週の金曜日",
"今週の日曜日",
"来週の月曜日",
"来週の水曜日"
]
},

{
    audio:"audio/19.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"コーヒー",
    choices:[
"お茶",
"水",
"コーヒー",
"ジュース"
]
},

{
    audio:"audio/20.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"ボールペン",
    choices:[
"ノート",
"えんぴつ",
"ボールペン",
"けしごむ"
]
},
{
    audio:"audio/21.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"家を出るのがおそかったから",
    choices:[
"電車がおくれたから",
"ねぼうしたから",
"家を出るのがおそかったから",
"バスがこなかったから"
]
},

{
    audio:"audio/22.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"木曜日",
    choices:[
"水曜日",
"木曜日",
"金曜日",
"土曜日"
]
},
{
    audio:"audio/23.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"電車",
    choices:[
"車",
"バス",
"タクシー",
"電車"
]
},
{
    audio:"audio/24.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"ともだち",
    choices:[
"おかあさん",
"おにいさん",
"ともだち",
"せんせい"
]
},
{
    audio:"audio/25.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"スーパー",
    choices:[
"びょういん",
"がっこう",
"スーパー",
"ホテル"
]
},

{
    audio:"audio/26.wav",
    q:"",
    answer:"コート",
    choices:[
"かさ",
"コート",
"ぼうし",
"てぶくろ"
]
},
{
    audio:"audio/27.wav",
    q:"",
    answer:"305ごうしつ",
    choices:[
"201ごうしつ",
"203ごうしつ",
"301ごうしつ",
"305ごうしつ"
]
},
{
    audio:"audio/28.wav",
    q:"",
    answer:"ハンバーグ",
    choices:[
"カレー",
"ハンバーグ",
"オムライス",
"ラーメン"
]
},
{
    audio:"audio/29.wav",
    q:"",
    answer:"ほんや",
    choices:[
"としょかん",
"ほんや",
"スーパー",
"ぎんこう"
]
},
{
    audio:"audio/30.wav",
    q:"",
    answer:"にもつをはこぶ",
    choices:[
"そうじをする",
"コピーをする",
"にもつをはこぶ",
"でんわをする"
]
},

{
    audio:"audio/31.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"10時",
    choices:[
"10時",
"9時",
"8時",
"10時半"
]
},
{
    audio:"audio/32.wav",
    q:"おんせいをきいてこたえなさい",
    answer:"としょかん",
    choices:[
"ほんや",
"としょかん",
"ぎんこう",
"スーパー"
]
},{
    audio:"audio/33.wav",
    image:"audio/33.png",
    q:"がぞうをみて、おんせいとあうものを選びなさい",
    answer:"a、2:b",
    choices:[
"1:a、2:b",
"1:b、2:b",
"1:c、2:a",
"1:c、2:b"
]
},{
    audio:"audio/34.wav",
    image:"audio/34.png",
    q:"がぞうをみて、おんせいとあうものを選びなさい",
    answer:"1:a、2:c",
    choices:[
"1:a、2:a",
"1:a、2:c",
"1:c、2:a",
"1:c、2:b"
]
},
];