let allGrammarData = [

{
    q:"　",
    kanji:"ウォノソボは、お茶の畑がたくさん（★）、のんびりしています。",
    answer:"あって",
    choices:["あって","あるせど","あります"]
},

{
    q:"　",
    kanji:"ホーチミンは、首都（しゅと）では（★）、とても大きい町です。",
    answer:"ないけど",
    choices:["ないじ","ないけど","ありません"]
},

{
    q:"　",
    kanji:"ウランバートルは（★）、人口（じんこう）がおおいです。",
    answer:"都会（とかい）だから",
    choices:["都会（とかい）で","都会（とかい）だから","都会（とかい）だけど","都会（とかい）です"]
},

{
    q:"　",
    kanji:"セブ島（とう）は、フィリピンに（★）、海がきれいな島（しま）です。",
    answer:"あって",
    choices:["あって","あるけ","あります"]
},

{
    q:"　",
    kanji:"ウォノソボは、（★）、すずしいです。",
    answer:"高原（こうげん）だから",
    choices:["高原（こうげん）だから","高原（こうげん）","高原（こうげん）です"]
},

{
    q:"　",
    kanji:"セブ島（とう）は、観光客（かんこうきゃく）が大勢（おおぜい）（★）、しずかです。",
    answer:"来るけど",
    choices:["来て","来るけど","来ます"]
},

{
    q:"　",
    kanji:"ホーチミンは、人が（★）、高いビルもたくさんあります。",
    answer:"多くて",
    choices:["多くて","多い","多いです"]
},

{
    q:"ただしいことばをえらびなさい。",
    kanji:"ウランバートルは、冬はとても（★）、家の中はあたたかいです。",
    answer:"寒いけど",
    choices:["寒いの","寒いけど","寒いです"]
},
{
    q:"A:原（はら）さんは、どの人ひとですか？ ",
    kanji:"B:原（はら）さんは、あそこで、本を読んでいる人です（★）。",
    answer:"よ",
    choices:["よ","ね","か"]
},
{
    q:"A:あのう、佐々木（ささき）さんは、どの人ひとですか？ ",
    kanji:"B:あの、髪（かみ）が短（みじか）くて、ひげをはやしている人です（★）。",
    answer:"よ",
    choices:["よ","ね","か"]
},
{
    q:"A:あのう、佐々木（ささき）さんは、どの人ひとですか？ 　　B:あの、髪（かみ）が短（みじか）くて、ひげをはやしている人ですよ。",
    kanji:"C:ありがとうございます。あのひげの人です（★）。",
    answer:"ね",
    choices:["よ","ね","か"]
},
{
    q:"　",
    kanji:"ほら、あの女の人、社長（しゃちょう）のお母さんです（★）。",
    answer:"よ",
    choices:["よ","ね","か"]
},
{
    q:"　",
    kanji:"あの人が、マイクさんです（★）？",
    answer:"か",
    choices:["よ","ね","か"]
},
{
    q:" A:すみません、ここに、山本（やまもと）さんという人ひとはいますか？",
    kanji:"B:山本（やまもと）さんは、あの人です（★）。",
    answer:"よ",
    choices:["よ","ね","か"]
},
{
    q:"A： この近（ちか）くに、いい店（みせ）がありますか？",
    kanji:"B：（★）、「平兵衛（へいべえ）」がおすすめです。",
    answer:"この近（ちか）くなら",
    choices:[
        "この近（ちか）くなら",
        "この近（ちか）くでも",
        "この近（ちか）くまで"
    ]
},
{
    image:"imgs/grammar/3.jpg",

    answer:"泳（およ）げる",
    choices:["泳（およ）げる","泳（およ）ぐ","泳（およ）いだ"
    ]
},
{
   image:"imgs/grammar/4.jpg",

    answer:"できる",
    choices:["できる","する","した"
    ]
},
{
    image:"imgs/grammar/5.jpg",

    answer:"入れる",
    choices:["入れる","入る","入った"]
},
{
    image:"imgs/grammar/6.jpg",
    answer:"見られる",
    choices:[
        "見られる","見る","見た"
    ]
},
{
    image:"imgs/grammar/7.jpg",
    answer:"できる",
    choices:["できる","でる","できた"]
},
{
    image:"imgs/grammar/8.jpg",
    answer:"食べられる",
    choices:["食べられる","食べ","食べた"]
},
{
    image:"imgs/grammar/9.jpg",
    answer:"できる",
    choices:["できる","する","した"]
},
{
    image:"imgs/grammar/10.jpg",

    answer:"見られる",
    choices:["見られる","見る","見えた","見ている"]
},
{
     image:"imgs/grammar/11.jpg",
   
    answer:"買える",
    choices:["買える","買う","買った","買っている"]
},
{
    kanji:"道（みち）を（★）とき、リスを見ました。",
    answer:"歩いている",
    choices:["歩く","歩いている","歩いた"]
},
{
 
    kanji:"沖縄（おきなわ）の海（うみ）をはじめて（★）とき、とても感動（かんどう）しました。",
    answer:"見た",
    choices:["見る","見ている","見た"]
},
{
     kanji:"日光（にっこう）に（★）とき、厚い上着（うわぎ）を持って行ったほうがいいですよ。",
    answer:"行く",
    choices:["行く","行っている","行った"]
},
{
     kanji:"ショーを（★）とき、ちょっと眠くなりました。",
    answer:"見ている",
    choices:["見る","見ている","見た"]
},
{
     kanji:"あべのハルカスに（★）とき、展望台（てんぼうだい）から空港（くうこう）が見えました。",
    answer:"登った",
    choices:["登る","登っている","登った"]
},
{
 
    kanji:"雨（あめ）が（★）とき、海で泳ぎたくないです。",
    answer:"降っている",
    choices:["降る","降っている","降った"]
},
{
 
    kanji:"お寺（てら）の中（なか）に（★）とき、くつを脱ぎました。",
    answer:"入る",
    choices:["入る","入っている","入った"]
},
{
     kanji:"ホテルに（★）とき、部屋（へや）からメールしますね。",
    answer:"着いた",
    choices:["着く","着いている","着いた"]
},
{
    "kanji":"今年（ことし）のゴールデンウィークの休（やす）みは、3日（みっか）（★）ありませんでした。",
    "answer":"しか",
    "choices":["だけ","しか"]
},
{
    "kanji":"成人式（せいじんしき）は、パーティー（★）参加（さんか）するつもりです。",
    "answer":"だけ",
    "choices":["だけ","しか"]
},
{
    "kanji":"今年（ことし）のひな祭（まつ）りは、ちらしずし（★）準備（じゅんび）しました。",
    "answer":"だけ",
    "choices":["だけ","しか"]
},
{
    "kanji":"あの店（みせ）は、いつも混（こ）んでいますが、今日（きょう）は10分（じゅっぷん）（★）待（ま）ちませんでした。",
    "answer":"しか",
    "choices":["だけ","しか"]
},
{
    "kanji":"日本（にほん）の神社（じんじゃ）は、明治（めいじ）神宮（じんぐう）（★）行（い）ったことがあります。",
    "answer":"だけ",
    "choices":["だけ","しか"]
},{
    "kanji":"お葬式（そうしき）には、どんな服（ふく）を着（き）て（★）いいですか。",
    "answer":"行けば",
    "choices":["行けば","行くと","行ったら"]
},
{
    "kanji":"このお酒（さけ）は、どうやって（★）いいですか。",
    "answer":"のめば",
    "choices":["のめば","のむと","のんだら"]
},
{
    "kanji":"花（はな）はだれに（★）いいですか。",
    "answer":"わたせば",
    "choices":["わたせば","わたすと","わたしたら"]
},
{
    "kanji":"今日（きょう）はどのように準備（じゅんび）（★）いいですか。",
    "answer":"すれば",
    "choices":["すれば","すると","したら"]
},
{
    "kanji":"図書館（としょかん）では大（おお）きい声（こえ）で（★）はいけません。",
    "answer":"話して",
    "choices":["話して","話しても","話した"]
},
{
    "kanji":"この部屋（へや）ではタバコを（★）ちゃだめです。",
    "answer":"すっ",
    "choices":["すっ","すい","すう"]
},

{
    "kanji":"試験中（しけんちゅう）はスマホを（★）はいけません。",
    "answer":"見て",
    "choices":["見ら","見る","見て"]
},
{
    "kanji":"ここに車（くるま）を（★）ちゃだめです。",
    "answer":"とめ",
    "choices":["とめ","とまっ","とめる"]
},
{
    "kanji":"パスポートをなくしても、そのままに（★）てはいけません。",
    "answer":"し",
    "choices":["し","する","した"]
},
{
    "kanji":"この薬（くすり）は一日（いちにち）に三回（さんかい）以上（いじょう）（★）じゃだめです。",
    "answer":"のん",
    "choices":["のん","のみ","のむ"]
},
  {
    "kanji":"ゴミばこに（★）ていました。",
    "answer":"すてられ",
    "choices":["すてられ","すてる","すてら"]
  },
  {
    "kanji":"電車（でんしゃ）のなかで、足を（★）たんです。",
    "answer":"ふまれ",
    "choices":["ふまれ","ふんだ","ふまられ"]
  },
  {
    "kanji":"さいふがない！さいふを（★）かもしれません。",
    "answer":"とられた",
    "choices":["とられた","とった","とらせた"]
  },
  {
    "kanji":"ころんで、ほねを（★）かもしれません。",
    "answer":"おった",
    "choices":["おった","おられた","おって"]
  },
  {
    "kanji":"資料（しりょう）が展示（てんじ）して（★）。",
    "answer":"あります",
    "choices":["います","あります","きます"]
  },
  {
    "kanji":"窓（まど）が開（あ）いて（★）。",
    "answer":"います",
    "choices":["います","あます","こます"]
  },
  {
    "kanji":"暑（あつ）いので、窓（まど）を開（あ）けて（★）。",
    "answer":"います",
    "choices":["います","あります","きます"]
  },
  {q:"にほんりょうり（★）すしが　すきです。",
choices:["なら","ので","けど"],
answer:"なら"},
{
q:"りゅうがく（★）にほんが　おすすめです。",
choices:["するなら","するから","するけど"],
answer:"するなら"},

{
q:"やすみのひ、でかける（★）うみに　いきたいです。",
choices:["なら","ので","けど"],answer:"なら"},

{q:"プレゼント（★）この とけいが いいです。",
choices:["なら","から","けど"],
answer:"なら"},

{q:"べんきょう（★）このほんが やくだちます。",
choices:["するなら","するので","するけど"],answer:"するなら"},

{q:"じかんが （★）てつだってください。",
choices:["あるなら","あるので","あるけど"],answer:"あるなら"},

{
q:"にほんへ （★）きょうとへも いってください。",
choices:["いくなら","いくので","いくけど"],
answer:"いくなら"},
];